/**************************************************************************
**************************************************************************/
#ifndef _SETUP_GLOBAL_H_
#define _SETUP_GLOBAL_H_

// 抖频总开关：1 = 强制关闭抖频；0 = 恢复原通信/调试控制。
#define C_PPGDP_ForceOff 1
 
/**************************************************************************
--------------------------------- 硬件配置 --------------------------------
**************************************************************************/
//配置内容：测温NTC上下拉
//配置说明：1 = IGBT测温NTC为上拉，0 = 下拉
#define  	_UP_NTC_IGBT_		0				
//配置说明：1 = 锅底测温NTC为上拉，0 = 下拉	
#define  	_UP_NTC_PAN_		1				
//配置说明：1 = 顶部测温NTC为上拉，0 = 下拉	
#define  	_UP_NTC_TOP_		1

/**************************************************************************
--------------------------------- 软件配置 --------------------------------
**************************************************************************/
//配置内容：工作模式 
//配置说明：1 = 调试模式，0 = 非调试模式
#define  	_MODE_IHDEBUG_		0	
//-------------------------------------------------------------------------
//配置内容：通信模式  
//配置说明：00 = 系统自动识别	
//			01 = 强制为有通信模式 
//			1x = 强制为无通信模式  
#define  	_MODE_COMM_NO_		0				
#define  	_MODE_COMM_HAVE_ 	1	
//-------------------------------------------------------------------------
//配置内容：风扇输出模式  
//配置说明：1 = PWM输出，0 = 普通IO输出
#define  	_FAN_OUT_PWM_		1															
 
/**************************************************************************
--------------------------------- 市电电压 --------------------------------
**************************************************************************/
//【市电电压对应AD值】：

//参数名称：市电电压对应AD值  
//参数说明：通过上电实测获取
#define  	C_AD_V280			211		 
#define  	C_AD_V220			163       		
#define  	C_AD_V160			118    		
#define  	C_AD_V100			72     		
#define  	C_AD_V80			58     		
//-------------------------------------------------------------------------
//【市电电压故障】：
 
//参数名称：高压故障判断电压值（V）
#define 	C_Vol_HighErr_In	275		
//参数名称：高压故障恢复电压值（V）		
#define 	C_Vol_HighErr_Out	265				

//参数名称：低压故障恢复电压值（V）
#define 	C_Vol_LowErr_Out	145
//参数名称：低压故障判断电压值（V）				
#define 	C_Vol_LowErr_In		125				
//-------------------------------------------------------------------------
//【市电电压区间】：
 
//参数名称：低压区间判断电压值（V）
#define 	C_Vol_Low			160	
//参数名称：中压区间判断电压值（V）			   
#define 	C_Vol_Mid			210	
//参数名称：高压区间判断电压值（V）			   
#define 	C_Vol_High			240				  
//-------------------------------------------------------------------------
//【市电电压计算】：

//参数名称：最大处理电压值（V）
#define  	C_Vol_Max			280
//参数名称：最小处理电压值（V）				 
#define  	C_Vol_Min			80				
 
//参数名称：计算补偿电压值（V）
//参数说明：便于使用8bit寄存器保存电压值
#define 	C_Vol_Comp			C_Vol_Min 
 
//参数名称：最大处理电压AD值
#define 	C_AD_VolMax			C_AD_V280
//参数名称：最小处理电压AD值		
#define 	C_AD_VolMin			C_AD_V80		

//参数名称：电压斜率
//计算公式：256 *（最大处理电压值-最小处理电压值）/（最大处理电压AD值-最小处理电压AD值）
#define 	C_Slope_Volatage	(unsigned int)256 * (C_Vol_Max - C_Vol_Min) / (C_AD_VolMax - C_AD_VolMin)

/**************************************************************************
--------------------------------- 工作电流 --------------------------------
**************************************************************************/
//计算公式：电流斜率 = 256 * 256 * 实际电流 / 检测的电流AD
//参数说明：电流斜率越大，功率越小

//参数名称：铁锅电流斜率
#define  	C_SlopeIron_Curr	4000//4000	
//参数名称：钢锅电流斜率		
#define  	C_SlopeSteel_Curr	4000//4000		

/**************************************************************************
--------------------------------- 锅具检测 --------------------------------
**************************************************************************/
//参数名称：有无锅判断值
//参数说明：>此判断值，即判断为无锅
#define 	C_Vaule_HaveNoPan	255		

//参数名称：钢铁锅判断值
//参数说明：<=此判断值，即判断为钢锅，否则为铁锅	
//实际数据：铁=215~239、钢=187~192
#define 	C_Vaule_SteelIron	203//(215+192)/2														
//------------------------------------------------------------------------- 
//参数名称：检锅间隔时间（实际：2秒）
#define 	C_Time_CheckPan		2000/C_TimeMS_Main	

//参数名称：停止加热检锅间隔时间（实际：2秒）
#define 	C_Time_StopCheck	2000/C_TimeMS_Main	

/**************************************************************************
---------------------------------- PPG输出 --------------------------------
**************************************************************************/
//参数名称：PPG导通延时值	 
//取值范围：0~15		
//对应关系：0=不延时，1=4~5*125ns，2=8~9*125ns，……15=64~65*125ns 
#define 	C_PPGDly			0				 
//------------------------------------------------------------------------- 
//取值范围：0~4095 
//计算公式：PPG导通时间 = PPG导通值 / 32MHz

//参数名称：单次检锅PPG导通值
#define 	C_PPGSingle			300				

//参数名称：铁锅点火PPG导通值
#define 	C_PPGFirst_Iron		300 		
//参数名称：钢锅点火PPG导通值
#define 	C_PPGFirst_Steel	300	
//参数名称：低压铁锅点火PPG导通值		 
#define 	C_PPGFirst_VL_Iron	300	 
//参数名称：低压钢锅点火PPG导通值	 
#define 	C_PPGFirst_VL_Steel	300			

//参数名称：铁锅起始PPG导通值
#define 	C_PPGStart_Iron		300		
//参数名称：钢锅起始PPG导通值
#define 	C_PPGStart_Steel	300	
//参数名称：低压铁锅起始PPG导通值
#define 	C_PPGStart_VL_Iron	300		 	
//参数名称：低压钢锅起始PPG导通值	
#define 	C_PPGStart_VL_Steel	300		
//------------------------------------------------------------------------- 
//取值范围：0~4095 
//计算公式：PPG导通时间 = PPG导通值 / 32MHz

//参数名称：默认最大PPG导通值 
#define 	C_PPGMax  			400	
//参数名称：铁锅最大PPG导通值 			
#define 	C_PPGMax_Iron  		400	
//参数名称：钢锅最大PPG导通值 	
#define 	C_PPGMax_Steel 		400				
 
//参数名称：最小PPG导通值  
#define 	C_PPGMin			360		

/**************************************************************************
--------------------------------- 功率处理 --------------------------------
**************************************************************************/	
//参数名称：功率处理因数																																							
#define  	C_Mult_Power		10//20				
//------------------------------------------------------------------------- 
//参数名称：恒流阶段电流（A）
#define 	C_Currer_Const		4.5//4.5				
//-------------------------------------------------------------------------  
//参数名称：低压电流丢锅判断功率（W）		
#define 	C_PowerLose_VLow	100//350	
//参数名称：非低压电流丢锅判断功率（W）
#define 	C_PowerLose_VHigh	300//650			 
 
/**************************************************************************
---------------------------------- 比较器 ---------------------------------
**************************************************************************/	
//参数名称：电压浪涌保护设置值
//取值范围：0~24
//对应关系：1.6V~4V（共25档，每档0.1V） 
#define 	C_Vol_VolSurge		22	
//-------------------------------------------------------------------------  		
//参数名称：电流浪涌保护设置值
//取值范围：0~255		
//计算公式：保护电压（IO） = 设置值 * 4 / 255												
#define 	C_Vol_CurrSurge		117      	
//-------------------------------------------------------------------------  											
//参数名称：导通台阶保护设置值
//取值范围：0~255		
//计算公式：保护电压（IO） = 设置值 * 4 / 255										
#define 	C_Vol_OnStep		80		
//-------------------------------------------------------------------------  
//参数名称：1级过压保护设置值（实际：1.22KV）
//取值范围：0~255		
//计算公式：保护电压（IO） = 设置值 * 4 / 255		 
#define 	C_Vol_BackPress1	175 

//参数名称：1级过压保护PPG下降步进
//取值范围：0~15		
//对应关系：0=0个，1=2个，……15=30个	
#define 	C_PPG_BackPress1	10	  
//-------------------------------------------------------------------------  
//参数名称：2级过压保护设置值（实际：1.3KV）
//取值范围：0~24		
//对应关系：1.6V~4V（共25档，每档0.1V）  	 
#define 	C_Vol_BackPress2	13
//-------------------------------------------------------------------------  
//参数名称：线盘电压判断值
//取值范围：0~19
//对应关系：0.1V~2V（共20档，每档0.1V） 
#define 	C_Vol_CoilVol		0	
//-------------------------------------------------------------------------  
//参数名称：过零翻转判断值（常压）
//取值范围：0~31
//对应关系：0.1V~3.2V（共32档，每档0.1V）			
#define 	C_Vol_ZeroTurn		8				

//参数名称：过零翻转判断值（高压）
//取值范围：0~31
//对应关系：0.1V~3.2V（共32档，每档0.1V）			
#define 	C_Vol_ZeroTurn_VH	12	

//参数名称：过零翻转判断值（低压）
//取值范围：0~31
//对应关系：0.1V~3.2V（共32档，每档0.1V）			
#define 	C_Vol_ZeroTurn_VL	8	

/**************************************************************************
----------------------------------- PGA -----------------------------------
**************************************************************************/	
//参数名称：PGA放大倍数设置值
//取值范围：0~3
//对应关系：0=8倍、1=16倍、2=32倍、3=64倍
#define 	C_Times_PGA			1	

/**************************************************************************
--------------------------------- 顶部NTC ---------------------------------
**************************************************************************/	
//硬件结构：100K热敏电阻 + 10K固定电阻
//软件结构：8bit-AD
//------------------------------------------------------------------------- 
//参数名称：顶部NTC开路判断温度AD值
#define 	C_AD_Top_OpenIn		3	
//参数名称：顶部NTC开路恢复温度AD值			
#define 	C_AD_Top_OpenOut	7				
//-------------------------------------------------------------------------  
//参数名称：顶部NTC短路判断温度AD值
#define 	C_AD_Top_CloseIn	252
//参数名称：顶部NTC短路恢复温度AD值				
#define 	C_AD_Top_CloseOut	248		
 
/**************************************************************************
--------------------------------- 锅底NTC ---------------------------------
**************************************************************************/	
//硬件结构：100K热敏电阻 + 5.1K固定电阻
//软件结构：8bit-AD
//------------------------------------------------------------------------- 
//参数名称：锅底开风扇判断温度AD值
#define 	C_AD_Pan_FanOn		44//60℃//74//80℃
//参数名称：锅底关风扇判断温度AD值
#define 	C_AD_Pan_FanOff		38//66//75℃
////------------------------------------------------------------------------- 
// 前提为设置成PWM风扇
//参数名称：锅底风速2档判断温度AD值
#define 	C_AD_Pan_FanLev2	58	//70℃
//参数名称：锅底风速3档判断温度AD值
#define 	C_AD_Pan_FanLev3	92	//90℃
//-------------------------------------------------------------------------
//参数名称：锅底超温判断温度AD值 
#define 	C_AD_Pan_OverIn  	237//220℃//224	
//参数名称：锅底超温恢复温度AD值			
#define 	C_AD_Pan_OverOut 	231//220				
//-------------------------------------------------------------------------  
//参数名称：锅底NTC开路判断温度AD值
#define 	C_AD_Pan_OpenIn		3	
//参数名称：锅底NTC开路恢复温度AD值			
#define 	C_AD_Pan_OpenOut	7				
//-------------------------------------------------------------------------  
//参数名称：锅底NTC短路判断温度AD值
#define 	C_AD_Pan_CloseIn	252
//参数名称：锅底NTC短路恢复温度AD值				
#define 	C_AD_Pan_CloseOut	248				

/**************************************************************************
-------------------------------- IGBT-NTC ---------------------------------
**************************************************************************/	
//硬件结构：100K热敏电阻 + 20K固定电阻
//软件结构：8bit-AD
//------------------------------------------------------------------------- 
//参数名称：IGBT开风扇判断温度AD值
#define 	C_AD_Igbt_FanOn 	91//50℃			
//参数名称：IGBT关风扇判断温度AD值 	
#define 	C_AD_Igbt_FanOff	80//45℃	
////------------------------------------------------------------------------- 
// 前提为设置成PWM风扇
//参数名称：IGBT风速2档判断温度AD值
#define 	C_AD_Igbt_FanLev2 	91//50℃
//#define 	C_AD_Igbt_FanLev2	103//55℃
//参数名称：IGBT风速3档判断温度AD值
#define 	C_AD_Igbt_FanLev3	147//75℃
//-------------------------------------------------------------------------  
//参数名称：IGBT超温判断温度AD值
#define 	C_AD_Igbt_OverIn   	205//110℃//139	
//参数名称：IGBT超温恢复温度AD值				
#define 	C_AD_Igbt_OverOut  	200//135				
//-------------------------------------------------------------------------  
//参数名称：IGBT高温判断温度AD值
#define 	C_AD_Igbt_HighIn	192//100℃
//参数名称：IGBT高温恢复温度AD值					
#define 	C_AD_Igbt_HighOut	187					
//-------------------------------------------------------------------------  
//参数名称：IGBT-NTC开路判断温度AD值	
#define 	C_AD_Igbt_OpenIn	3		
//参数名称：IGBT-NTC开路恢复温度AD值			
#define 	C_AD_Igbt_OpenOut	7				
//-------------------------------------------------------------------------  
//参数名称：IGBT-NTC短路判断温度AD值
#define 	C_AD_Igbt_CloseIn	252				
//参数名称：IGBT-NTC短路恢复温度AD值	
#define 	C_AD_Igbt_CloseOut	248					

/**************************************************************************
-------------------------------- 系统时间 ---------------------------------
**************************************************************************/
//参数名称：中断时间（us）
#define 	C_TimeUS_Int		50			
//参数名称：主循环时间（ms）	 
#define 	C_TimeMS_Main		5				 

/**************************************************************************
--------------------------------- EE地址 ----------------------------------
**************************************************************************/
//参数名称：电流斜率调节值EE寄存地址
//取值范围：0~127
#define 	C_EEAddr_CheckAA	100
#define  	C_EEAddr_DataP		101
#define  	C_EEAddr_DataI		102			
#define 	C_EEAddr_Check55	103

/**************************************************************************
--------------------------------- 测试设置 --------------------------------
**************************************************************************/
//测试内容：检锅
//设置说明：有定义 = 检锅测试，无定义 = 正常检锅 	
//#define  	_TEST_PANCHECK_

//测试内容：PPG输出
//设置说明：有定义 = PPG测试输出，无定义 = PPG正常输出 
//#define  	_TEST_PPGOUT_		500	
//-------------------------------------------------------------------------	
//测试内容：比较器结果
//设置说明：有定义 = IO输出比较器结果，无定义 = IO正常输出  
//			测试输出口只能选择RA0或RB7，由config中的“CMPOUT_SEL”决定 
//#define  	_TEST_CMPOUT_		0xA0	//比较器测试输出口（RA0）
//#define  	_TEST_CMPOUT_		0xB7	//比较器测试输出口（RB7）

//参数名称：被测试比较器通道	 
//取值范围：0~7			
#define  	C_CMOUTEN_Num		0	
//-------------------------------------------------------------------------	
//测试内容：PGA放大结果
//设置说明：有定义 = IO输出PGA放大结果，无定义 = IO正常输出
//			测试输出口只能选择RC0  
//#define  	_TEST_PGAOUT_	
 
/**************************************************************************
**************************************************************************/
#endif

